FactoryBot.define do
  factory :log do
    name { "2020/12/10" }
    content { sample_log }
  end
end

def sample_log
  <<~EOS
    L1412 | 18:25 | 三般東喰赤－ | 夜叉丸(+46.0) こむぎ(-7.0) v-bind(-39.0)
    L1412 | 18:33 | 四般東喰赤－ | 夜叉丸(+40.0) v-bind(+5.0) こむぎ(-35.0) グランドクロス(-30.0)
    L1412 | 18:44 | 三般東喰赤－ | 夜叉丸(+69.0) こむぎ(-18.0) グランドクロス(-51.0)
    L1412 | 19:25 | 三般東喰赤－ | こむぎ(+36.0) 夜叉丸(-7.0) v-bind(-39.0)
    L1045 | 20:50 | 三般南喰赤－ | はらこ2(+43.0) ゴトゴト(-5.0) RaFaFa(-38.0)
    L1045 | 21:09 | 三般南喰赤－ | ゴトゴト(+62.0) はらこ2(-20.0) RaFaFa(-42.0)
    L1045 | 21:29 | 三般南喰赤－ | ピラフ大魔王(+66.0) RaFaFa(-6.0) あきのののり(-60.0)
    L1045 | 21:38 | 三般南喰赤－ | ピラフ大魔王(+53.0) RaFaFa(-5.0) あきのののり(-48.0)
  EOS
end
