def user_seed(name)
  {
    name: name,
    password: "password",
    team_id: 1
  }
end

names = ["こむぎ", "夜叉丸", "グランドクロス", "麻雀たろう", "v-bind"]

if Rails.env == "development"
  Team.create!(id: 1, name: "フルスタック麻雀部", join_key: 34323)
  User.create!(user_seed("komugi"))
  User.create!(user_seed("yasyamaru"))
  names.each do |name|
    TenhouAccount.create!(name: name, team_id: 1)
  end

  start = Date.new(2020, 10)
  last = Date.new(2020, 12)
  (start..last).each do |date|
    TeamLog.create!(
      name: date.strftime("%Y/%m/%d"),
      team_id: 1,
      content: "[\"L1412 | 18:25 | 三般東喰赤－ | 夜叉丸(+46.0) こむぎ(-7.0) v-bind(-39.0)\", \"L1412 | 18:33 | 四般東喰赤－ | 夜叉丸(+40.0) v-bind(+5.0) こむぎ(-35.0) グランドクロス(-30.0)\", \"L1412 | 18:44 | 三般東喰赤－ | 夜叉丸(+69.0) こむぎ(-18.0) グランドクロス(-51.0)\", \"L1412 | 19:25 | 三般東喰赤－ | こむぎ(+36.0) 夜叉丸(-7.0) v-bind(-39.0)\", \"L1412 | 19:33 | 四般東喰赤－ | グランドクロス(+40.0) v-bind(+5.0) こむぎ(-35.0) 夜叉丸(-30.0)\", \"L1412 | 19:44 | 三般東喰赤－ | こむぎ(+69.0) 夜叉丸(-18.0) グランドクロス(-51.0)\", \"L1412 | 19:53 | 四般東喰赤－ | v-bind(+40.0) こむぎ(+155.0) グランドクロス(-35.0) 夜叉丸(-30.0)\", \"L1412 | 19:53 | 四般東喰赤－ | v-bind(+40.0) グランドクロス(+5.0) 夜叉丸(-35.0) こむぎ(-30.0)\", \"L1412 | 19:56 | 四般東喰赤－ | こむぎ(+60.0) グランドクロス(+5.0) 夜叉丸(-35.0) v-bind(-30.0)\", \"L1412 | 19:59 | 三般東喰赤－ | 夜叉丸(+69.0) こむぎ(-18.0) グランドクロス(-51.0)\", \"L1412 | 20:09 | 三般東喰赤－ | グランドクロス(+69.0) こむぎ(-18.0) 夜叉丸(-51.0)\", \"L1412 | 20:12 | 三般東喰赤－ | v-bind(+69.0) こむぎ(-18.0) 夜叉丸(-51.0)\", \"L1412 | 20:56 | 四般東喰赤－ | 麻雀たろう(+40.0) グランドクロス(+5.0) 夜叉丸(-35.0) v-bind(-30.0)\", \"L1412 | 20:59 | 四般東喰赤－ | 夜叉丸(+90.0) グランドクロス(+5.0) 麻雀たろう(-65.0) v-bind(-30.0)\", \"L1412 | 20:56 | 四般東喰赤－ | 麻雀たろう(+40.0) グランドクロス(+5.0) 夜叉丸(-35.0) v-bind(-30.0)\", \"L1412 | 21:44 | 三般東喰赤－ | こむぎ(+69.0) 夜叉丸(-18.0) グランドクロス(-51.0)\", \"L1412 | 22:53 | 四般東喰赤－ | v-bind(+40.0) 麻雀たろう(+5.0) グランドクロス(-35.0) 夜叉丸(-30.0)\"]"
    )
  end
end
